app/controllers/articles_controller.rb

  def edit
    @article = Article.find(params[:id]) #storing the article record in an instance var, this allows the edit view template to have access to the Article object
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]